
#include "convtable.h"

// ローマ字仮名変換表

const ROMAN_KANA_CONV roman_kana_conv_default[ROMAN_KANA_TBL_DEF_NUM] =
{
	{L"a",  L"あ", L"ア", L"ｱ"}, {L"i",  L"い", L"イ", L"ｲ"}, {L"u",  L"う", L"ウ", L"ｳ"}, {L"e",  L"え", L"エ", L"ｴ"}, {L"o",  L"お", L"オ", L"ｵ"},
	{L"ka", L"か", L"カ", L"ｶ"}, {L"ki", L"き", L"キ", L"ｷ"}, {L"ku", L"く", L"ク", L"ｸ"}, {L"ke", L"け", L"ケ", L"ｹ"}, {L"ko", L"こ", L"コ", L"ｺ"},
	{L"sa", L"さ", L"サ", L"ｻ"}, {L"si", L"し", L"シ", L"ｼ"}, {L"su", L"す", L"ス", L"ｽ"}, {L"se", L"せ", L"セ", L"ｾ"}, {L"so", L"そ", L"ソ", L"ｿ"},
	{L"ta", L"た", L"タ", L"ﾀ"}, {L"ti", L"ち", L"チ", L"ﾁ"}, {L"tu", L"つ", L"ツ", L"ﾂ"}, {L"te", L"て", L"テ", L"ﾃ"}, {L"to", L"と", L"ト", L"ﾄ"},
	{L"na", L"な", L"ナ", L"ﾅ"}, {L"ni", L"に", L"ニ", L"ﾆ"}, {L"nu", L"ぬ", L"ヌ", L"ﾇ"}, {L"ne", L"ね", L"ネ", L"ﾈ"}, {L"no", L"の", L"ノ", L"ﾉ"},
	{L"ha", L"は", L"ハ", L"ﾊ"}, {L"hi", L"ひ", L"ヒ", L"ﾋ"}, {L"hu", L"ふ", L"フ", L"ﾌ"}, {L"he", L"へ", L"ヘ", L"ﾍ"}, {L"ho", L"ほ", L"ホ", L"ﾎ"},
	{L"ma", L"ま", L"マ", L"ﾏ"}, {L"mi", L"み", L"ミ", L"ﾐ"}, {L"mu", L"む", L"ム", L"ﾑ"}, {L"me", L"め", L"メ", L"ﾒ"}, {L"mo", L"も", L"モ", L"ﾓ"},
	{L"ya", L"や", L"ヤ", L"ﾔ"},                              {L"yu", L"ゆ", L"ユ", L"ﾕ"},                              {L"yo", L"よ", L"ヨ", L"ﾖ"},
	{L"ra", L"ら", L"ラ", L"ﾗ"}, {L"ri", L"り", L"リ", L"ﾘ"}, {L"ru", L"る", L"ル", L"ﾙ"}, {L"re", L"れ", L"レ", L"ﾚ"}, {L"ro", L"ろ", L"ロ", L"ﾛ"},
	{L"wa", L"わ", L"ワ", L"ﾜ"},	                                                                                    {L"wo", L"を", L"ヲ", L"ｦ"},

	{L"yi", L"い", L"イ", L"ｲ"},
	{L"ye", L"いぇ", L"イェ", L"ｲｪ"},
	{L"wi", L"うぃ", L"ウィ", L"ｳｨ"},
	{L"wu", L"う",   L"ウ",   L"ｳ"},
	{L"we", L"うぇ", L"ウェ", L"ｳｪ"},

	{L"ga", L"が", L"ガ", L"ｶﾞ"}, {L"gi", L"ぎ", L"ギ", L"ｷﾞ"}, {L"gu", L"ぐ", L"グ", L"ｸﾞ"}, {L"ge", L"げ", L"ゲ", L"ｹﾞ"}, {L"go", L"ご", L"ゴ", L"ｺﾞ"},
	{L"za", L"ざ", L"ザ", L"ｻﾞ"}, {L"zi", L"じ", L"ジ", L"ｼﾞ"}, {L"zu", L"ず", L"ズ", L"ｽﾞ"}, {L"ze", L"ぜ", L"ゼ", L"ｾﾞ"}, {L"zo", L"ぞ", L"ゾ", L"ｿﾞ"},
	{L"da", L"だ", L"ダ", L"ﾀﾞ"}, {L"di", L"ぢ", L"ヂ", L"ﾁﾞ"}, {L"du", L"づ", L"ヅ", L"ﾂﾞ"}, {L"de", L"で", L"デ", L"ﾃﾞ"}, {L"do", L"ど", L"ド", L"ﾄﾞ"},
	{L"ba", L"ば", L"バ", L"ﾊﾞ"}, {L"bi", L"び", L"ビ", L"ﾋﾞ"}, {L"bu", L"ぶ", L"ブ", L"ﾌﾞ"}, {L"be", L"べ", L"ベ", L"ﾍﾞ"}, {L"bo", L"ぼ", L"ボ", L"ﾎﾞ"},

	{L"pa", L"ぱ", L"パ", L"ﾊﾟ"}, {L"pi", L"ぴ", L"ピ", L"ﾋﾟ"}, {L"pu", L"ぷ", L"プ", L"ﾌﾟ"}, {L"pe", L"ぺ", L"ペ", L"ﾍﾟ"}, {L"po", L"ぽ", L"ポ", L"ﾎﾟ"},

	{L"kya", L"きゃ", L"キャ", L"ｷｬ"}, {L"kyi", L"きぃ", L"キィ", L"ｷｨ"}, {L"kyu", L"きゅ", L"キュ", L"ｷｭ"}, {L"kye", L"きぇ", L"キェ", L"ｷｪ"}, {L"kyo", L"きょ", L"キョ", L"ｷｮ"},
	{L"sya", L"しゃ", L"シャ", L"ｼｬ"}, {L"syi", L"しぃ", L"シィ", L"ｼｨ"}, {L"syu", L"しゅ", L"シュ", L"ｼｭ"}, {L"sye", L"しぇ", L"シェ", L"ｼｪ"}, {L"syo", L"しょ", L"ショ", L"ｼｮ"},
	{L"sha", L"しゃ", L"シャ", L"ｼｬ"}, {L"shi", L"し",   L"シ",   L"ｼ" }, {L"shu", L"しゅ", L"シュ", L"ｼｭ"}, {L"she", L"しぇ", L"シェ", L"ｼｪ"}, {L"sho", L"しょ", L"ショ", L"ｼｮ"},
	{L"tya", L"ちゃ", L"チャ", L"ﾁｬ"}, {L"tyi", L"ちぃ", L"チィ", L"ﾁｨ"}, {L"tyu", L"ちゅ", L"チュ", L"ﾁｭ"}, {L"tye", L"ちぇ", L"チェ", L"ﾁｪ"}, {L"tyo", L"ちょ", L"チョ", L"ﾁｮ"},
	{L"cha", L"ちゃ", L"チャ", L"ﾁｬ"}, {L"chi", L"ち",   L"チ",   L"ﾁ" }, {L"chu", L"ちゅ", L"チュ", L"ﾁｭ"}, {L"che", L"ちぇ", L"チェ", L"ﾁｪ"}, {L"cho", L"ちょ", L"チョ", L"ﾁｮ"},
	{L"nya", L"にゃ", L"ニャ", L"ﾆｬ"}, {L"nyi", L"にぃ", L"ニィ", L"ﾆｨ"}, {L"nyu", L"にゅ", L"ニュ", L"ﾆｭ"}, {L"nye", L"にぇ", L"ニェ", L"ﾆｪ"}, {L"nyo", L"にょ", L"ニョ", L"ﾆｮ"},
	{L"hya", L"ひゃ", L"ヒャ", L"ﾋｬ"}, {L"hyi", L"ひぃ", L"ヒィ", L"ﾋｨ"}, {L"hyu", L"ひゅ", L"ヒュ", L"ﾋｭ"}, {L"hye", L"ひぇ", L"ヒェ", L"ﾋｪ"}, {L"hyo", L"ひょ", L"ヒョ", L"ﾋｮ"},
	{L"fa",  L"ふぁ", L"ファ", L"ﾌｧ"}, {L"fi",  L"ふぃ", L"フィ", L"ﾌｨ"}, {L"fu",  L"ふ",   L"フ",   L"ﾌ" }, {L"fe",  L"ふぇ", L"フェ", L"ﾌｪ"}, {L"fo",  L"ふぉ", L"フォ", L"ﾌｫ"},
	{L"mya", L"みゃ", L"ミャ", L"ﾐｬ"}, {L"myi", L"みぃ", L"ミィ", L"ﾐｨ"}, {L"myu", L"みゅ", L"ミュ", L"ﾐｭ"}, {L"mye", L"みぇ", L"ミェ", L"ﾐｪ"}, {L"myo", L"みょ", L"ミョ", L"ﾐｮ"},
	{L"rya", L"りゃ", L"リャ", L"ﾘｬ"}, {L"ryi", L"りぃ", L"リィ", L"ﾘｨ"}, {L"ryu", L"りゅ", L"リュ", L"ﾘｭ"}, {L"rye", L"りぇ", L"リェ", L"ﾘｪ"}, {L"ryo", L"りょ", L"リョ", L"ﾘｮ"},

	{L"gya", L"ぎゃ", L"ギャ", L"ｷﾞｬ"}, {L"gyi", L"ぎぃ", L"ギィ", L"ｷﾞｨ"}, {L"gyu", L"ぎゅ", L"ギュ", L"ｷﾞｭ"}, {L"gye", L"ぎぇ", L"ギェ", L"ｷﾞｪ"}, {L"gyo", L"ぎょ", L"ギョ", L"ｷﾞｮ"},
	{L"zya", L"じゃ", L"ジャ", L"ｼﾞｬ"}, {L"zyi", L"じぃ", L"ジィ", L"ｼﾞｨ"}, {L"zyu", L"じゅ", L"ジュ", L"ｼﾞｭ"}, {L"zye", L"じぇ", L"ジェ", L"ｼﾞｪ"}, {L"zyo", L"じょ", L"ジョ", L"ｼﾞｮ"},
	{L"ja",  L"じゃ", L"ジャ", L"ｼﾞｬ"}, {L"ji",  L"じ",   L"ジ",   L"ｼﾞ" }, {L"ju",  L"じゅ", L"ジュ", L"ｼﾞｭ"}, {L"je",  L"じぇ", L"ジェ", L"ｼﾞｪ"}, {L"jo",  L"じょ", L"ジョ", L"ｼﾞｮ"},
	{L"dya", L"ぢゃ", L"ヂャ", L"ﾁﾞｬ"}, {L"dyi", L"ぢぃ", L"ヂィ", L"ﾁﾞｨ"}, {L"dyu", L"ぢゅ", L"ヂュ", L"ﾁﾞｭ"}, {L"dye", L"ぢぇ", L"ヂェ", L"ﾁﾞｪ"}, {L"dyo", L"ぢょ", L"ヂョ", L"ﾁﾞｮ"},
	{L"bya", L"びゃ", L"ビャ", L"ﾋﾞｬ"}, {L"byi", L"びぃ", L"ビィ", L"ﾋﾞｨ"}, {L"byu", L"びゅ", L"ビュ", L"ﾋﾞｭ"}, {L"bye", L"びぇ", L"ビェ", L"ﾋﾞｪ"}, {L"byo", L"びょ", L"ビョ", L"ﾋﾞｮ"},

	{L"pya", L"ぴゃ", L"ピャ", L"ﾋﾟｬ"}, {L"pyi", L"ぴぃ", L"ピィ", L"ﾋﾟｨ"}, {L"pyu", L"ぴゅ", L"ピュ", L"ﾋﾟｭ"}, {L"pye", L"ぴぇ", L"ピェ", L"ﾋﾟｪ"}, {L"pyo", L"ぴょ", L"ピョ", L"ﾋﾟｮ"},

	{L"tsa",  L"つぁ", L"ツァ", L"ﾂｧ"}, {L"tsi",  L"つぃ", L"ツィ", L"ﾂｨ"}, {L"tsu",  L"つ", L"ツ", L"ﾂ"},      {L"tse",  L"つぇ", L"ツェ", L"ﾂｪ"}, {L"tso",  L"つぉ", L"ツォ", L"ﾂｫ"},

	{L"tha", L"てゃ", L"テャ", L"ﾃｬ"},  {L"thi", L"てぃ", L"ティ", L"ﾃｨ"},  {L"thu", L"てゅ", L"テュ", L"ﾃｭ"},  {L"the", L"てぇ", L"テェ", L"ﾃｪ"},  {L"tho", L"てょ", L"テョ", L"ﾃｮ"},
	{L"dha", L"でゃ", L"デャ", L"ﾃﾞｬ"}, {L"dhi", L"でぃ", L"ディ", L"ﾃﾞｨ"}, {L"dhu", L"でゅ", L"デュ", L"ﾃﾞｭ"}, {L"dhe", L"でぇ", L"デェ", L"ﾃﾞｪ"}, {L"dho", L"でょ", L"デョ", L"ﾃﾞｮ"},
	{L"twa", L"たぁ", L"タァ", L"ﾀｧ"},  {L"twi", L"てぃ", L"ティ", L"ﾃｨ"},  {L"twu", L"とぅ", L"トゥ", L"ﾄｩ"},  {L"twe", L"てぇ", L"テェ", L"ﾃｪ"},  {L"two", L"とぉ", L"トォ", L"ﾄｫ"},
	{L"dwa", L"だぁ", L"ダァ", L"ﾀﾞｧ"}, {L"dwi", L"でぃ", L"ディ", L"ﾃﾞｨ"}, {L"dwu", L"どぅ", L"ドゥ", L"ﾄﾞｩ"}, {L"dwe", L"でぇ", L"デェ", L"ﾃﾞｪ"}, {L"dwo", L"どぉ", L"ドォ", L"ﾄﾞｫ"},

	{L"jya", L"じゃ", L"ジャ", L"ｼﾞｬ"}, {L"jyi", L"じ",   L"ジ",   L"ｼﾞ"},  {L"jyu", L"じゅ", L"ジュ", L"ｼﾞｭ"}, {L"jye", L"じぇ", L"ジェ", L"ｼﾞｪ"}, {L"jyo", L"じょ", L"ジョ", L"ｼﾞｮ"},
	{L"cya", L"ちゃ", L"チャ", L"ﾁｬ"},  {L"cyi", L"ち",   L"チ",   L"ﾁ" },  {L"cyu", L"ちゅ", L"チュ", L"ﾁｭ"},  {L"cye", L"ちぇ", L"チェ", L"ﾁｪ"},  {L"cyo", L"ちょ", L"チョ", L"ﾁｮ"},
	{L"hwa", L"ふぁ", L"ファ", L"ﾌｧ"},  {L"hwi", L"ふぃ", L"フィ", L"ﾌｨ"},  {L"hwu", L"ふ",   L"フ",   L"ﾌ" },  {L"hwe", L"ふぇ", L"フェ", L"ﾌｪ"},  {L"hwo", L"ふぉ", L"フォ", L"ﾌｫ"},
	{L"wha", L"わ",   L"ワ",   L"ﾜ"},   {L"whi", L"うぃ", L"ウィ", L"ｳｨ"},  {L"whu", L"う",   L"ウ",   L"ｳ"},   {L"whe", L"うぇ", L"ウェ", L"ｳｪ"},  {L"who", L"うぉ", L"ウォ", L"ｳｫ"},
	{L"kwa", L"くぁ", L"クァ", L"ｸｧ"},  {L"kwi", L"くぃ", L"クィ", L"ｸｨ"},  {L"kwu", L"く",   L"ク",   L"ｸ"},   {L"kwe", L"くぇ", L"クェ", L"ｸｪ"},  {L"kwo", L"くぉ", L"クォ", L"ｸｫ"},
	{L"gwa", L"ぐぁ", L"グァ", L"ｸﾞｧ"}, {L"gwi", L"ぐぃ", L"グィ", L"ｸﾞｨ"}, {L"gwu", L"ぐ",   L"グ",   L"ｸﾞ"},  {L"gwe", L"ぐぇ", L"グェ", L"ｸﾞｪ"}, {L"gwo", L"ぐぉ", L"グォ", L"ｸﾞｫ"},
	{L"fya", L"ふゃ", L"フャ", L"ﾌｬ"},  {L"fyi", L"ふぃ", L"フィ", L"ﾌｨ"},  {L"fyu", L"ふゅ", L"フュ", L"ﾌｭ"},  {L"fye", L"ふぇ", L"フェ", L"ﾌｪ"},  {L"fyo", L"ふょ", L"フョ", L"ﾌｮ"},
	{L"hwya", L"ふゃ", L"フャ", L"ﾌｬ"}, {L"hwyi", L"ふぃ", L"フィ", L"ﾌｨ"}, {L"hwyu", L"ふゅ", L"フュ", L"ﾌｭ"}, {L"hwye", L"ふぇ", L"フェ", L"ﾌｪ"}, {L"hwyo", L"ふょ", L"フョ", L"ﾌｮ"},

	{L"nn", L"ん", L"ン", L"ﾝ"},
	{L"n'", L"ん", L"ン", L"ﾝ"},
	{L"nb", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nc", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nd", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nf", L"ん", L"ン", L"ﾝ", TRUE},
	{L"ng", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nh", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nj", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nk", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nm", L"ん", L"ン", L"ﾝ", TRUE},
	{L"np", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nr", L"ん", L"ン", L"ﾝ", TRUE},
	{L"ns", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nt", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nv", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nw", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nx", L"ん", L"ン", L"ﾝ", TRUE},
	{L"nz", L"ん", L"ン", L"ﾝ", TRUE},

	{L"mb", L"ん", L"ン", L"ﾝ", TRUE},
	{L"mm", L"ん", L"ン", L"ﾝ", TRUE},
	{L"mp", L"ん", L"ン", L"ﾝ", TRUE},

	{L"xtu",  L"っ", L"ッ", L"ｯ"},
	{L"xtsu", L"っ", L"ッ", L"ｯ"},
	{L"bb", L"っ", L"ッ", L"ｯ", TRUE},
	{L"cc", L"っ", L"ッ", L"ｯ", TRUE},
	{L"dd", L"っ", L"ッ", L"ｯ", TRUE},
	{L"ff", L"っ", L"ッ", L"ｯ", TRUE},
	{L"gg", L"っ", L"ッ", L"ｯ", TRUE},
	{L"hh", L"っ", L"ッ", L"ｯ", TRUE},
	{L"jj", L"っ", L"ッ", L"ｯ", TRUE},
	{L"kk", L"っ", L"ッ", L"ｯ", TRUE},
	{L"pp", L"っ", L"ッ", L"ｯ", TRUE},
	{L"rr", L"っ", L"ッ", L"ｯ", TRUE},
	{L"ss", L"っ", L"ッ", L"ｯ", TRUE},
	{L"tt", L"っ", L"ッ", L"ｯ", TRUE},
	{L"vv", L"っ", L"ッ", L"ｯ", TRUE},
	{L"ww", L"っ", L"ッ", L"ｯ", TRUE},
	{L"yy", L"っ", L"ッ", L"ｯ", TRUE},
	{L"xx", L"っ", L"ッ", L"ｯ", TRUE},
	{L"zz", L"っ", L"ッ", L"ｯ", TRUE},

	{L"xa", L"ぁ", L"ァ", L"ｧ"},
	{L"xi", L"ぃ", L"ィ", L"ｨ"},
	{L"xu", L"ぅ", L"ゥ", L"ｩ"},
	{L"xe", L"ぇ", L"ェ", L"ｪ"},
	{L"xo", L"ぉ", L"ォ", L"ｫ"},
	{L"xya", L"ゃ", L"ャ", L"ｬ"},
	{L"xyi", L"い", L"イ", L"ｲ"},
	{L"xyu", L"ゅ", L"ュ", L"ｭ"},
	{L"xye", L"え", L"エ", L"ｴ"},
	{L"xyo", L"ょ", L"ョ", L"ｮ"},
	{L"xwa", L"ゎ", L"ヮ", L"ﾜ"},
	{L"xwi", L"ゐ", L"ヰ", L"ｲ"},
	{L"xwu", L"う", L"ウ", L"ｳ"},
	{L"xwe", L"ゑ", L"ヱ", L"ｴ"},
	{L"xwo", L"を", L"ヲ", L"ｦ"},

	//か け
	{L"xka", L"ゕ", L"ヵ", L"ｶ"},	//full width katakana small 'ka'
	{L"xke", L"ゖ", L"ヶ", L"ｹ"},	//full width katakana small 'ke'

	//う゛ゔ
	{L"va", L"う゛ぁ", L"ヴァ", L"ｳﾞｧ"},
	{L"vi", L"う゛ぃ", L"ヴィ", L"ｳﾞｨ"},
	{L"vu", L"う゛",   L"ヴ",   L"ｳﾞ"},
	{L"ve", L"う゛ぇ", L"ヴェ", L"ｳﾞｪ"},
	{L"vo", L"う゛ぉ", L"ヴォ", L"ｳﾞｫ"},
	{L"xva", L"ゔぁ", L"ヷ", L"ﾜﾞ"},
	{L"xvi", L"ゔぃ", L"ヸ", L"ｲﾞ"},
	{L"xvu", L"ゔ",   L"ヴ", L"ｳﾞ"},
	{L"xve", L"ゔぇ", L"ヹ", L"ｴﾞ"},
	{L"xvo", L"ゔぉ", L"ヺ", L"ｦﾞ"},

	//鼻濁音
	{L"xnga", L"か゚", L"カ゚", L"ｶﾟ"},
	{L"xngi", L"き゚", L"キ゚", L"ｷﾟ"},
	{L"xngu", L"く゚", L"ク゚", L"ｸﾟ"},
	{L"xnge", L"け゚", L"ケ゚", L"ｹﾟ"},
	{L"xngo", L"こ゚", L"コ゚", L"ｺﾟ"},

	//アイヌ語用仮名
	{L"xnse", L"セ゚", L"セ゚", L"ｾﾟ"},
	{L"xntu", L"ツ゚", L"ツ゚", L"ﾂﾟ"},
	{L"xntsu", L"ツ゚", L"ツ゚", L"ﾂﾟ"},
	{L"xnto", L"ト゚", L"ト゚", L"ﾄﾟ"},
	{L"xku", L"ㇰ", L"ㇰ", L"ｸ"},
	{L"xsi", L"ㇱ", L"ㇱ", L"ｼ"},
	{L"xshi", L"ㇱ", L"ㇱ", L"ｼ"},
	{L"xsu", L"ㇲ", L"ㇲ", L"ｽ"},
	{L"xto", L"ㇳ", L"ㇳ", L"ﾄ"},
	{L"xnu", L"ㇴ", L"ㇴ", L"ﾇ"},
	{L"xha", L"ㇵ", L"ㇵ", L"ﾊ"},
	{L"xhi", L"ㇶ", L"ㇶ", L"ﾋ"},
	{L"xhu", L"ㇷ", L"ㇷ", L"ﾌ"},
	{L"xfu", L"ㇷ", L"ㇷ", L"ﾌ"},
	{L"xhe", L"ㇸ", L"ㇸ", L"ﾍ"},
	{L"xho", L"ㇹ", L"ㇹ", L"ﾎ"},
	{L"xpu", L"ㇷ゚", L"ㇷ゚", L"ﾌﾟ"},
	{L"xmu", L"ㇺ", L"ㇺ", L"ﾑ"},
	{L"xra", L"ㇻ", L"ㇻ", L"ﾗ"},
	{L"xri", L"ㇼ", L"ㇼ", L"ﾘ"},
	{L"xru", L"ㇽ", L"ㇽ", L"ﾙ"},
	{L"xre", L"ㇾ", L"ㇾ", L"ﾚ"},
	{L"xro", L"ㇿ", L"ㇿ", L"ﾛ"},

	{L"xnnse", L"セ", L"セ", L"ｾ"},		//平仮名片仮名変換用
	{L"xnntu", L"ツ", L"ツ", L"ﾂ"},		//〃
	{L"xnnto", L"ト", L"ト", L"ﾄ"},		//〃

	//濁点、半濁点
	{L"v,", L"゛", L"゛", L"ﾞ"},			//濁点「う゛」→「ｳﾞ」
	{L"v.", L"゜", L"゜", L"ﾟ"},			//半濁点
	{L"x,", L"\x3099", L"\x3099", L"ﾞ"},	//結合文字用濁音
	{L"x.", L"\x309A", L"\x309A", L"ﾟ"},	//結合文字用半濁音「か゚」→「ｶﾟ」

	//数字
	{L"0", L"0", L"0", L"0"}, {L"1", L"1", L"1", L"1"},
	{L"2", L"2", L"2", L"2"}, {L"3", L"3", L"3", L"3"},
	{L"4", L"4", L"4", L"4"}, {L"5", L"5", L"5", L"5"},
	{L"6", L"6", L"6", L"6"}, {L"7", L"7", L"7", L"7"},
	{L"8", L"8", L"8", L"8"}, {L"9", L"9", L"9", L"9"},

	//記号
	{L"\x20", L"\x20", L"\x20", L"\x20"},
	{L"!", L"！", L"！", L"!"},		//full-width
	{L"\"", L"\"", L"\"", L"\""},
	{L"#", L"#", L"#", L"#"},
	{L"$", L"$", L"$", L"$"},
	{L"%", L"%", L"%", L"%"},
	{L"&", L"&", L"&", L"&"},
	{L"'", L"'", L"'", L"'"},
	{L"(", L"(", L"(", L"("},
	{L")", L")", L")", L")"},
	{L"*", L"*", L"*", L"*"},
	{L"+", L"+", L"+", L"+"},
	{L",", L"、", L"、", L"､"},		//full-width, half width katakana
	{L"-", L"ー", L"ー", L"ｰ"},		//full-width, half width katakana
	{L".", L"。", L"。", L"｡"},		//full-width, half width katakana
	{L"/", L"/", L"/", L"/"},
	//   [0-9]   //
	{L":", L":", L":", L":"},
	{L";", L";", L";", L";"},
	{L"<", L"<", L"<", L"<"},
	{L"=", L"=", L"=", L"="},
	{L">", L">", L">", L">"},
	{L"?", L"？", L"？", L"?"},		//full-width
	{L"@", L"@", L"@", L"@"},
	//   [A-Z]   //
	{L"[", L"「", L"「", L"｢"},		//full-width, half width katakana
	{L"\\", L"\\", L"\\", L"\\"},
	{L"]", L"」", L"」", L"｣"},		//full-width, half width katakana
	{L"^", L"^", L"^", L"^"},
	{L"_", L"_", L"_", L"_"},
	{L"`", L"`", L"`", L"`"},
	//   [a-z]   //
	{L"{", L"{", L"{", L"{"},
	{L"|", L"|", L"|", L"|"},
	{L"}", L"}", L"}", L"}"},
	{L"~", L"~", L"~", L"~"},

	//z記号
	{L"z\x20", L"　", L"　", L"　"},	//full width space
	{L"z,", L"‥", L"‥", L"‥"},
	{L"z-", L"～", L"～", L"～"},
	{L"z.", L"…", L"…", L"…"},
	{L"z/", L"・", L"・", L"･"},		//half width katakana
	{L"z(", L"（", L"（", L"（"},
	{L"z)", L"）", L"）", L"）"},
	{L"z[", L"『", L"『", L"『"},
	{L"z]", L"』", L"』", L"』"},
	{L"z{", L"【", L"【", L"【"},
	{L"z}", L"】", L"】", L"】"},
	{L"zh", L"←", L"←", L"←"},
	{L"zj", L"↓", L"↓", L"↓"},
	{L"zk", L"↑", L"↑", L"↑"},
	{L"zl", L"→", L"→", L"→"},
	{L"zL", L"⇒", L"⇒", L"⇒"},
	{L"z;", L"゛", L"゛", L"ﾞ"},		//濁点
	{L"z:", L"゜", L"゜", L"ﾟ"},		//半濁点

	{L"",L"",L"",L""}
};

// ASCII全英変換表

const ASCII_JLATIN_CONV ascii_jlatin_conv_default[ASCII_JLATIN_TBL_NUM] =
{
	{L" ", L"　"}, {L"!", L"！"}, {L"\"", L"”"}, {L"#", L"＃"}, {L"$", L"＄"}, {L"%", L"％"}, {L"&", L"＆"}, {L"\'", L"’"},
	{L"(", L"（"}, {L")", L"）"}, {L"*", L"＊"}, {L"+", L"＋"}, {L",", L"，"}, {L"-", L"－"}, {L".", L"．"}, {L"/", L"／"},

	{L"0", L"０"}, {L"1", L"１"}, {L"2", L"２"}, {L"3", L"３"}, {L"4", L"４"}, {L"5", L"５"}, {L"6", L"６"}, {L"7", L"７"},
	{L"8", L"８"}, {L"9", L"９"}, {L":", L"："}, {L";", L"；"}, {L"<", L"＜"}, {L"=", L"＝"}, {L">", L"＞"}, {L"?", L"？"},

	{L"@", L"＠"}, {L"A", L"Ａ"}, {L"B", L"Ｂ"}, {L"C", L"Ｃ"}, {L"D", L"Ｄ"}, {L"E", L"Ｅ"}, {L"F", L"Ｆ"}, {L"G", L"Ｇ"},
	{L"H", L"Ｈ"}, {L"I", L"Ｉ"}, {L"J", L"Ｊ"}, {L"K", L"Ｋ"}, {L"L", L"Ｌ"}, {L"M", L"Ｍ"}, {L"N", L"Ｎ"}, {L"O", L"Ｏ"},

	{L"P", L"Ｐ"}, {L"Q", L"Ｑ"}, {L"R", L"Ｒ"}, {L"S", L"Ｓ"}, {L"T", L"Ｔ"}, {L"U", L"Ｕ"}, {L"V", L"Ｖ"}, {L"W", L"Ｗ"},
	{L"X", L"Ｘ"}, {L"Y", L"Ｙ"}, {L"Z", L"Ｚ"}, {L"[", L"［"}, {L"\\", L"＼"}, {L"]", L"］"}, {L"^", L"＾"}, {L"_", L"＿"},

	{L"`", L"‘"}, {L"a", L"ａ"}, {L"b", L"ｂ"}, {L"c", L"ｃ"}, {L"d", L"ｄ"}, {L"e", L"ｅ"}, {L"f", L"ｆ"}, {L"g", L"ｇ"},
	{L"h", L"ｈ"}, {L"i", L"ｉ"}, {L"j", L"ｊ"}, {L"k", L"ｋ"}, {L"l", L"ｌ"}, {L"m", L"ｍ"}, {L"n", L"ｎ"}, {L"o", L"ｏ"},

	{L"p", L"ｐ"}, {L"q", L"ｑ"}, {L"r", L"ｒ"}, {L"s", L"ｓ"}, {L"t", L"ｔ"}, {L"u", L"ｕ"}, {L"v", L"ｖ"}, {L"w", L"ｗ"},
	{L"x", L"ｘ"}, {L"y", L"ｙ"}, {L"z", L"ｚ"}, {L"{", L"｛"}, {L"|", L"｜"}, {L"}", L"｝"}, {L"~", L"～"},

	{L"",L""}
};
